<h1>MovieLens 25M</h1>

<hr>
<h2>0. Introduction</h2>

<p>This dataset describes 5-star rating and free-text tagging activity from MovieLens (https://movielens.org), a movie recommendation service. The dataset is available for download at https://grouplens.org/datasets/movielens/25m/.</p>

<p>The explored version here is the MovieLes 25M Dataset, a stable benchamrk version, with 25 million ratings and one million tag applications applied to 62,000 movies by 162,000 users. Includes tag genome data with 15 million relevance scores across 1,129 tags. Released 12/2019.</p>

<p>We could discover more information by just reading the dataset's README file, but we are not doing that since the purpose of this notebook is analyzing the exploration process.</p>

Steps:
<ol>
    <li>Reading Data</li>
    <li>Data Types Inference</li>
    <li>Missing Values Count and Treatment</li>
    <li>Statistical Analysis, Describe</li>
    <li>Numerical Univariate Analysis, Graphical</li>
    <li>Numerical Bivariate Analysis, Graphical</li>
    <li>Probable Outliers</li>
    <li>Correlation</li>
    <li>Dimensionality Reduction</li>
</ol

<h2>1. Reading Data</h2>

<p>The first step in the exploration process is loading your data to be able to analyze it with your selected tool. Actually, one could argue the first step is ingesting or obtaining this data, but we are not concerned with this part here.</p>

<p>Assuming we already have our data available, let's start by loading it.</p>

In [24]:
# Viewing what is in the directory
!cd ml-25m; ls

genome-scores.csv  links.csv   ratings.csv
genome-tags.csv    movies.csv  tags.csv

Here, we can see the data is in the ml-25m directory, and is composed by multiple csv files. Let's load them all at once.

In [25]:
# Importing stuff
import os
import numpy as np
import pandas as pd

In [50]:
import time

def read_multiple_csv(filepath, df_names=None):

    '''
    Improved version of pd.read_csv, which can read multiple files in a directory
    If df_names == None, it iterates the whole directory.
    
    Receives the path and optionally a list of the dataframes names.
    Returns a dict of the names and dataframes.
    
    uses import os, pandas as pd
    the folder should have only csv files, no .txt
    '''
    start_time = time.time()
    df_list = []
    
    # Here the function uses the names of the dataframes to read the files
    if df_names is not None:
        df_names = np.char.array(df_names)
        filepath = np.full(df_names.shape, filepath)
        reader = filepath + df_names + '.csv'
        
        temp_df = [pd.read_csv(i) for i in reader]
        df_list.append(temp_df)
    
    # If names are not given, the function just reads all data in folder
    else:
        df_names = []
        path, dirs, files = next(os.walk(filepath))
        file_count = len(files)
        for i in range(file_count):
            temp_df = pd.read_csv(filepath + files[i])
            df_list.append(temp_df)
            df_names.append(files[i][:-4])
    
    df_dict = dict(zip(df_names, df_list))
    
    return 'Execution time: {0} seconds'.format(time.time() - start_time)

print(read_multiple_csv('./ml-25m/', ['genome-scores', 'genome-tags', 'links', 'movies', 'ratings', 'tags']
))

dataframes_names = ['genome-scores', 'genome-tags', 'links', 'movies', 'ratings', 'tags']

def read_multiple_csv(filepath, df_names=None):

    '''
    Improved version of pd.read_csv, which can read multiple files in a directory
    If df_names == None, it iterates the whole directory.
    
    Receives the path and optionally a list of the dataframes names.
    Returns a dict of the names and dataframes.
    
    uses import os, pandas as pd
    the folder should have only csv files, no .txt
    '''
    start_time = time.time()
    df_list = []
    
    # Here the function uses the names of the dataframes to read the files
    if df_names is not None:
        for i in range(len(df_names)):
            temp_df = pd.read_csv(filepath + df_names[i] + '.csv')
            df_list.append(temp_df)
    
    # If names are not given, the function just reads all data in folder
    else:
        df_names = []
        path, dirs, files = next(os.walk(filepath))
        file_count = len(files)
        for i in range(file_count):
            temp_df = pd.read_csv(filepath + files[i])
            df_list.append(temp_df)
            df_names.append(files[i][:-4])
    
    df_dict = dict(zip(df_names, df_list))
    
    return 'Execution time old: {0} seconds'.format(time.time() - start_time)

# note: I'll probably change this to return a list of dataframes and define an attribute dataframe.name

print(read_multiple_csv('./ml-25m/', ['genome-scores', 'genome-tags', 'links', 'movies', 'ratings', 'tags']
))

Execution time: 7.290629148483276 seconds
Execution time old: 6.957117795944214 seconds

Tried to optimize by vectorizing, but little difference was noticed, for the cost of readability. I'll come back to this later.

In [27]:
dataframes_names = ['genome-scores', 'genome-tags', 'links', 'movies', 'ratings', 'tags']

def read_multiple_csv(filepath, df_names=None):

    '''
    Improved version of pd.read_csv, which can read multiple files in a directory
    If df_names == None, it iterates the whole directory.
    
    Receives the path and optionally a list of the dataframes names.
    Returns a dict of the names and dataframes.
    
    uses import os, pandas as pd
    the folder should have only csv files, no .txt
    '''
    df_list = []
    
    # Here the function uses the names of the dataframes to read the files
    if df_names is not None:
        for i in range(len(df_names)):
            temp_df = pd.read_csv(filepath + df_names[i] + '.csv')
            df_list.append(temp_df)
    
    # If names are not given, the function just reads all data in folder
    else:
        df_names = []
        path, dirs, files = next(os.walk(filepath))
        file_count = len(files)
        for i in range(file_count):
            temp_df = pd.read_csv(filepath + files[i])
            df_list.append(temp_df)
            df_names.append(files[i][:-4])
    
    df_dict = dict(zip(df_names, df_list))
    
    return df_dict

In [28]:
dataframes = read_multiple_csv('./ml-25m/')
print(dataframes.keys())

dict_keys(['movies', 'genome-tags', 'genome-scores', 'tags', 'links', 'ratings'])

In [29]:
list(dataframes.values())[0]

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
62418,209157,We (2018),Drama
62419,209159,Window of the Soul (2001),Documentary
62420,209163,Bad Poems (2018),Comedy|Drama
62421,209169,A Girl Thing (2001),(no genres listed)
62422,209171,Women of Devil's Island (1962),Action|Adventure|Drama

Let's define a function that displays multiple dataframes, it's going to be very useful later.

In [40]:
from IPython.core.display import HTML

def multi_table(table_list):
    ''' Acceps a list of IpyTable objects and returns a table which contains each IpyTable in a cell
    '''
    return HTML(
        ''.join(
            ('<table><tr style="background-color:white;">', 
        ''.join(['<td>' + table._repr_html_() + '</td>' for table in table_list]),
        '</tr></table>')
        )
    )

multi_table(dataframes.values())

# source: https://github.com/epmoyer/ipy_table/issues/24

<h2>2. Dataset Description</h2>

<p>Now we can actually work with our dataframes. Our first step will be checking the types of each column in each dataframe.</p>

In [41]:
def dfdict_dtypes(dataframes_dict):
    '''
    receives dataframes_dict, a dictionary with the keys being the names of the dataframes
    and the values being the dataframes
    
    returns a list of dataframes with each showing the types of each column of each original 
    dataframe
    '''
    df_types_list = []
    
    for df_name, df in dataframes_dict.items():
        # checking the types of the columns
        df_types = df.dtypes
        
        # now an array with the columns names and values is created 
        types_df = np.array((df_types.index, df_types.values))
        
        # finally, a dataframe is created out of this array and appended to the df_types_list
        df_types_list.append(pd.DataFrame([types_df[1]], columns=types_df[0], index=['type']))
    
    return df_types_list

dfs_types = dfdict_dtypes(dataframes)

for df_name, df in dataframes.items():
    print(df_name)
    print(dataframes[df_name].dtypes, end='\n\n')

movies
movieId     int64
title      object
genres     object
dtype: object

genome-tags
tagId     int64
tag      object
dtype: object

genome-scores
movieId        int64
tagId          int64
relevance    float64
dtype: object

tags
userId        int64
movieId       int64
tag          object
timestamp     int64
dtype: object

links
movieId      int64
imdbId       int64
tmdbId     float64
dtype: object

ratings
userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object

<p>Now we'll check for missing values in the dataframes and uniformize the missing values.</p>

In [42]:
import time

In [43]:
# first version of the function

def multiple_missing_values_for_time(dataframes_dict):
    '''
    receives dataframes_dict, a dictionary with the keys being the names of the dataframes
    and the values being the dataframes
    
    returns a list of dataframes with each showing the amount of missing values from each
    column of each original dataframe
    '''
    start_time = time.time() # checking speed
    missing_values_df_list = []
    
    for df_name, df in dataframes_dict.items():
        missing_values_df = {}
        
        for i, value in enumerate(df):
            df_missing_values = df.isnull().sum()
            missing_values_df[str(list(df_missing_values.index)[i])] = list(df_missing_values.values)[i]
                
        missing_values_df = pd.DataFrame(missing_values_df, index=['missing'])
        missing_values_df_list.append(missing_values_df)
        
    return 'Execution time: {0} seconds'.format(time.time() - start_time) # should actually return missing_values_df_list

# now vectorizing the inner for loop

def multiple_missing_values_time(dataframes_dict):
    '''
    receives dataframes_dict, a dictionary with the keys being the names of the dataframes
    and the values being the dataframes
    
    returns a list of dataframes with each showing the amount of missing values from each
    column of each original dataframe
    '''
    start_time = time.time() # checking speed
    missing_values_df_list = []
    
    for df_name, df in dataframes_dict.items():
        # computing and storing missing values
        df_missing_values = df.isnull().sum()
        
        # now an array with the columns names and values is created 
        missing_values_df = np.array((df_missing_values.index, df_missing_values.values))
        
        # finally, a dataframe is created out of this array and appended to the missing_values_list
        missing_values_df_list.append(pd.DataFrame([missing_values_df[1]], columns=missing_values_df[0], index=['missing']))
    

    return 'Execution time: {0} seconds'.format(time.time() - start_time) # should actually return missing_values_df_list


print(multiple_missing_values_for_time(dataframes))
print(multiple_missing_values_time(dataframes))

Execution time: 1.05549955368042 seconds
Execution time: 0.2696866989135742 seconds

The vectorized version is about 4 times as fast as the other one due to the parallel computing implementation of numpy, so that's the one we'll keep.

In [44]:
def multiple_missing_values(dataframes_dict):
    '''
    receives dataframes_dict, a dictionary with the keys being the names of the dataframes
    and the values being the dataframes
    
    returns a list of dataframes with each showing the amount of missing values from each
    column of each original dataframe
    '''
    missing_values_df_list = []
    
    for df_name, df in dataframes_dict.items():
        # computing and storing missing values
        df_missing_values = df.isnull().sum()
        
        # now an array with the columns names and values is created 
        missing_values_df = np.array((df_missing_values.index, df_missing_values.values))
        
        # finally, a dataframe is created out of this array and appended to the missing_values_list
        missing_values_df_list.append(pd.DataFrame([missing_values_df[1]], columns=missing_values_df[0], index=['missing']))
    
    return missing_values_df_list

In [45]:
display(multiple_missing_values(dataframes)[0])

         movieId  title  genres
missing        0      0       0

<p>This version is fast enough for now, so let's not further optimize right now.</p>
<p>Now displaying the result.</p>

In [47]:
df_list = multiple_missing_values(dataframes)
multi_table(df_list)

# source: https://github.com/epmoyer/ipy_table/issues/24

In [49]:
# displaying columns types
multi_table(dfs_types)

Then statistical analysis

In [69]:
def dflist_describe(dataframes_dict):
    '''
    receives dataframes_dict, a dictionary with the keys being the names of the dataframes
    and the values being the dataframes
    
    returns a list of dataframes with each showing the types of each column of each original 
    dataframe
    '''
    df_descriptions_list = []
    
    for df_name, df in dataframes_dict.items():
        # checking the types of the columns
        df_descriptions = df.describe(include='all')
        
        # finally, a dataframe is created out of this array and appended to the df_types_list
        df_descriptions_list.append(df_descriptions)
    
    return df_descriptions_list

# note: try the next one, source https://stackoverflow.com/questions/38783027/jupyter-notebook-display-two-pandas-tables-side-by-side

def mydisplay(dfs, names=[]):

    count = 0
    maxTables = 6

    if not names:
        names = [x for x in range(len(dfs))]

    html_str = ''
    html_th = ''
    html_td = ''

    for df, name in zip(dfs, names):
        if count <= (maxTables):
            html_th += (''.join(f'<th style="text-align:center">{name}</th>'))
            html_td += (''.join(f'<td style="vertical-align:top"> {df.to_html(index=False)}</td>'))
            count += 1
        else:
            html_str += f'<tr>{html_th}</tr><tr>{html_td}</tr>'
            html_th = f'<th style="text-align:center">{name}</th>'
            html_td = f'<td style="vertical-align:top"> {df.to_html(index=False)}</td>'
            count = 0


    if count != 0:
        html_str += f'<tr>{html_th}</tr><tr>{html_td}</tr>'


    html_str += f'<table>{html_str}</table>'
    html_str = html_str.replace('table','table style="display:inline"')
    display_html(html_str, raw=True)

In [71]:
multi_table(dflist_describe(dataframes)) # I want to show the titles of the dataframes above them, but it's better if I do it after changing dict to list